// Строгий режим
"use strict";

// Завдання
/*Задача №1
Що потрапить в консоль?*/

let someVar = 0;
++someVar;

if (someVar) {
  console.log(someVar);
}
/*1.let someVar = 0;- створюємо змінну "someVar", де зберігається значення "0".
2.++someVar; - збільшуємо "someVar" + 1. Тобто "someVar" зараз зберігає значення "1".
3.if (someVar) - перевіряємо "someVar" не дорівнює "0". Бо "0" - це "false", все інше - "true".
4.console.log(someVar); - виводе значення "1" у консоль.*/

/*Задача №2
За допомогою циклу FOR виведіть в консоль 10 рядків:
Пункт №1
Пункт №2
і т.д.
1.for (let i = 1; i <= 10; i++) - створюю цикл FOR.
2.let i = 1; - створюю змінну, яка дорівнює "1".
3.i <= 10; i++ - додаю умову, при який "i" за допомогою інкременту "i++" ,буде збільшуватись від "1" до "10",після кожної ітерації циклу, а цикл FOR буде повторюватись поки "i" менше чи рівне 10.
4.console.log - виведе рядки до консолі.
*/

for (let i = 1; i <= 10; i++) {
  console.log(`Пункт №${i}`);
}
/*Задача №3
Що потрапить в консоль ?*/
if (2 * 20 <= 10 || (30 / 2 < 5 && 10 <= "10") || 20 === "20") {
  console.log("000");
}
/*
1. 2 * 20 <= 10 - 40 більше, і не рівне за 10. Це - "false".

2. 30 / 2 < 5 && 10 <= "10"  це false. Розберемо.
2.1 30 / 2 < 5 - 15 менше 5 - це false.
2.2 10 <= "10" - відбувається неявне перетворення типів. Порівняння числа 10 з рядком "10" - буде true.
2.3 false && true - результат виразу false.

3. 20 === "20" - на цьому етапі відбувається строге порівняння типів, яке не дозволяє неявне перетворення типів. Одже - false.

4. Загальний вираз має вигляд
 false || false || false - результат виразу false.

Виходить, що умова є "false", у консоль нічого не потрапить.
*/

/*Задача №4
Створіть функцію, яка повертає результат ділення числа a на число b з додаванням рядка "Результат ділення: "
Викличте функцію передаючі різні значення, у тому числі не передаючи зовсім.
Функція не має повертати NaN, Infinite або помилку */

function someFunc(a, b) {
  if (b === 0) {
    console.log("Error: Ділення на нуль некоректне");
  } else {
    let result = a / b;
    if (isNaN(result) || !isFinite(result)) {
      console.log("Error: Ділення некоректне");
    } else {
      console.log(`Your result: ${result}`);
    }
  }
}
someFunc(2, 0); // Error: Ділення на нуль некоректне
someFunc("string", 3); // Error: Ділення некоректне
someFunc(18, 2); // Результат ділення: 9
/*
if (b === 0) - перевіряю, чи b дорівнює 0? Якщо дорівнює, вивожу повідомлення "Error: Ділення на нуль некоректне".
let result = a / b; - розраховую ділення і перевіряю, коректне число чи ні і не є NaN або Infinite.Якщо результат 
коректний, функція виводить результат, якщо не коректний
отримуємо повідомлення "Error: Ділення некоректне".



/*Задача №5
Створіть масив даних - 5 елементів, один з яких число 10
Обробіть масив за допомогою методу перебору
Перевіряйте елемент на відповідність числу 10, та у разі відповідності, виводьте в консоль*/

let someArray = [8, 9, 10, 11, 12];
someArray.forEach((value, index) => {
  if (value === 10) {
    console.log(`Елемент ${index} має відповідність числу 10`);
  }
});
/*
1. let someArray = [8, 9, 10, 11, 12]; - створив масив.
2. someArray.forEach((value, index) => - перебираю масив за допомогою методу forEach.
3.if (value === 10) - провожу перевірку, чи дорівнює числу 10 поточний елемент.
4.console.log(`Елемент ${index} має відповідність числу 10`) - у разі відповідності, вивожу в консоль.
*/

// Текст з ефектом друку
const text = "Привіт!";
let template = ``;

function createText(someText) {
  for (let i = 0; i < someText.length; ++i) {
    const item = someText[i];
    template += `<span style="animation-delay: 0.${i}s">${item}</span>`;
  }
}
createText(text);

const page = document.querySelector(".page");
page.insertAdjacentHTML("beforeend", template);
